Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཏིང་ངེ་འཛིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྗོད་དུ་མེད་པ་མངོན་སུམ་དུ་བྱེད་དོ། ། དེ་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ཤར་ཕྱོགས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལས་འདས་པ་བདག་གིས་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་ལུང་སྟོན་པ་དང་། དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། དེ་བཞིན་དུ་ཤར་དང་། ལྷོའི་མཚམས་ནས་འོག་དང་། སྟེང་གི་བར་དང་། ཕྱོགས་བཅུ་ཀུན་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བས་ལྷག་པ་དག་གིས་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་ལུང་སྟོན་པ་མཐོང་ངོ་། །
en: “He directly perceived a hundred thousand million billion indescribable concentrations. By means of the power and knowledge of his superior abilities, he could see that to the east there were many more lords, buddhas, than there are grains of sand in the river Ganges, who were making the prediction, ‘Innumerable eons in the future, young brahmin, you will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’ Likewise, to the south, the west, the north, the northeast, the southeast, the southwest, and the northwest, above and below, throughout the ten directions of space, there were many more lords, buddhas than there are grains of sand in the river Ganges, who were making the prediction, ‘Innumerable eons in the future, young brahmin, you will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ལུང་བསྟན་པ་ཐོས་ནས་དབུགས་ཕྱིན་པར་གྱུར་ཏེ། ནམ་མཁའི་དཀྱིལ་དེ་ནས་བབས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེའི་དྲུང་དུ། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། ཚངས་པར་སྤྱད་པ་སྤྱོད་དོ། །
en: “Then, Śāriputra, when the young brahmin Megha had received this prediction, he was greatly inspired and descended from the sky. In the presence of the Lord, the Tathāgata Dīpaṅkara, he followed his conviction and left the household life behind to become a renunciant and follow the life of purity.

source: ཤཱ་རིའི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་དེ་ལྟར་དོགས་ཤིང་ཐེ་ཚོམ་ཟ་ན་ དེ་ལྟར་མི་བལྟའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་ཅེས་བྱ་བར་གྱུར་པ་དེ་ཡིན་ཏེ། ངས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ་ལ་མེ་ཏོག་ཨུད་པ་ལ་ལྔ་གཏོར་ཏེ་རལ་བ་ཡང་བཏིང་ངོ་། །
en: “Now, Śāriputra, no one should entertain any doubt, any uncertainty, about whether the young brahmin named Megha who appeared at this time, on this occasion, was anyone else. Why not? It was I who was the young brahmin named Megha who appeared at that time, on that occasion. It was I who showered the Lord, the Tathāgata Dīpaṅkara, with five blue lotuses and offered my locks of hair.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པ་མྱུར་དུ་ཐོབ་པར་འདོད་པ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན་པར་བྱ། བླང་བར་བྱ། གཟུང་བར་བྱ། གཞན་དག་ལ་ཡང་བརྗོད་པར་བྱ། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། ། གང་འདི་མཚན་མ་མེད་པའི་སྤྱོད་པས་ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱའོ། །
en: “Therefore, Śāriputra, those bodhisatvas who wish to quickly receive a prediction of awakening should conscientiously study this cycle of teachings contained in The Collected Teachings on the Bodhisatva, learn it, recite it, clarify it to others, and teach it in great detail. They should strive to make progress in these things, which represent an approach that has no attributes.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་ངས་མངོན་པར་ཤེས་ཏེ་འདས་པའི་དུས་ན་མར་མེ་མཛད་ཀྱི་ཕ་རོལ་ན་ངས་དཀར་པོའི་ཆོས་ཀྱི་སྤྱོད་པ་གང་ལ་མ་སྤྱད་པ་དེ་གང་ཡང་མེད་དེ། འོན་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ལུང་མ་བསྟན་ཏོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ང་མཚན་མ་དང་བཅས་པར་སྤྱོད་པར་གྱུར་ཏོ། ། གང་གི་ཚེ་ང་གང་འདི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མཚན་མ་མེད་པར་སྤྱོད་པ། དམིགས་པ་མེད་པར་སྤྱོད་པ། ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་བསྒྲུབ་པས་གནས་པ་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་བྱ་བར་ང་ལུང་བསྟན་ཏོ། །
en: “Why should they do this? It is clear to me, Śāriputra, that in the past, after Dīpaṅkara, there was no form of good conduct that I did not engage in. Still, the lords, the buddhas, I had encountered before him did not predict my awakening. Why was that? It was because I was practicing by means of attributes. When I started to practice in a way that was free from attributes, though, in a way that had no object, when I started to practice the cycle of teachings contained in The Collected Teachings on the Bodhisatva and stabilized the attainment of what I learned from it, the Lord Dīpaṅkara made his prediction about me, saying, ‘Young brahmin, in the future you will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ངས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་མཐོང་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་མཐོང་མ་ཐག་ཏུ་སྤྱོད་པ་ཐམས་ཅད་ལས་འདས་ཏེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མཐོང་བ་ཁོང་དུ་ཆུད་དོ། ། མཐོང་མ་ཐག་ཏུ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པར་ཤེས་སོ། ། དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེས་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། ། ཞེས་ལུང་བསྟན་ཏོ།
en: “Śāriputra, when I saw the tathāgata, the arhat, the fully accomplished Buddha Dīpaṅkara, I passed beyond all practice. I passed beyond all practice just by seeing the tathāgata, the arhat, the fully accomplished Buddha Dīpaṅkara. I realized the vision of the sameness of all phenomena. Just by seeing him, I understood that all phenomena are inherently uncreated. That was when the Tathāgata Dīpaṅkara predicted my awakening, saying, ‘Innumerable eons in the future, young brahmin, you will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’

source: ལུང་བསྟན་མ་ཐག་ཏུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་བོ། ། བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཇི་ལྟ་བུ་ཞེ་ན། གང་འདི་གཟུགས་རབ་ཏུ་མི་རྙེད་པར་བཟོད་པར་བ་ཏུ་ཐོབ་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རབ་ཏུ་མི་རྙེད་པར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་མི་རྙེད་པར་བཟོད་པ་རབ་ཏུ་ཐོབ་པའོ། ། ཡང་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱ་བར་འདི་ནི་བཟོད་པ་མེད་པའི་ཆོས་རབ་ཏུ་ཐོབ་པའི་ཚིག་བླ་དགས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་ཆོས་དེ་ལ་ནི་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀུན་ཏུ་མི་འབྱུང་ངོ་། ། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་མ་ཡིན། སློབ་པའི་ཆོས་རྣམས་མ་ཡིན། མི་སློབ་པའི་ཆོས་རྣམས་མ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་མ་ཡིན་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མི་འབྱུང་ངོ་། ། ཆོས་ཐམས་ཅད་མི་འབྱུང་བས་དེའི་ཕྱིར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། ། ཆོས་ཐམས་ཅད་ཐོབ་པ་མེད་ཅིང་མི་དམིགས་པས་དེའི་ཕྱིར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། ། བཟོད་པ་དེ་ཡང་མཚན་མ་ཐམས་ཅད་དང་། དམིགས་པ་ཐམས་ཅད་ཀྱིས་སྐད་ཅིག་པ་ཡིན་ཏེ། དེའི་ཕྱིར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱ་སྟེ། དེ་ལ་ནི་མིག་མེད་དོ། ། མིག་ལ་སྨོས་པ་མེད་དོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། རྣ་བ་མེད། སྣ་མེད། ལྕེ་མེད། ལུས་མེད། ཡིད་མེད། ཡིད་ལ་སྨོས་པ་མེད་དེ། མི་བཟད་པའི་ཡུལ་དེ་ནི་བཟོད་པ། འགྲོ་བ་མེད་པའི་ཡུལ་དེ་ནི་བཟོད་པ་སྟེ། དེའི་ཕྱིར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། །
en: “The moment he had made that prediction, I gained patient acceptance of the fact that phenomena are uncreated. What is the attainment of this patient acceptance like? It is to attain the patient acceptance that form cannot be found. It is to attain the patient acceptance that feeling, perception, mental conditioning, and consciousness cannot be found. It is to attain the patient acceptance that nothing that is included within the skandhas, the elements, and the sense fields can be found. Another way of describing the attainment of patient acceptance is to say that it is the attainment of a state of non-acceptance. What does this mean? In this teaching on the attainment of patient acceptance there are no worldly phenomena that occur. There are no phenomena related to ordinary beings. There are no phenomena related to those who are in training. There are no phenomena related to those requiring no more training. There are no phenomena related to the bodhisatvas. Even the qualities of the Buddha do not occur. There are no phenomena at all that occur. This is why it is called the attainment of patient acceptance. It is called the attainment of patient acceptance because there is no attainment and no observation of any phenomena. In this patient acceptance, all attributes and all objects are nothing but words. This is why it is said that patient acceptance has been attained. There is no eye here. There is no description of the eye, and so forth. There is no ear, no nose, no tongue, no body, no mind, and no description of the mind. This is the patient acceptance of the place that is intolerable. This is the patient acceptance of the place it is impossible to go to.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ལུང་བསྟན་པ་མྱུར་དུ་ཐོབ་པར་འདོད་པ་དག་གིས་གང་འདི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མཚན་མ་མེད་པར་སྤྱོད་པ། ལྷུན་གྱིས་གྲུབ་པར་སྤྱོད་པ། དམིགས་པ་མེད་པར་སྤྱོད་པ། ཤིན་ཏུ་མཉན་པར་བྱ། བླང་བར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། གཞན་དག་ལ་ཡང་བརྗོད་པར་བྱ། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱའོ། །
en: “Śāriputra, this is why those bodhisatvas who wish to quickly receive a prediction of awakening should conscientiously study this practice of freedom from attributes, the practice of the spontaneous, the practice of having no object, which is contained in the cycle of teachings of The Collected Teachings on the Bodhisatva. They should learn it, recite it, clarify it to others, and teach it in great detail. They should strive to make progress in these things.”

source: ཡང་དེའི་ཚེ་འཁོར་དེ་ཉིད་དུ་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་ཞེས་བྱ་བ་འདུས་པར་གྱུར་ཏེ་ འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་དང་། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྣམས་ཐོས་ནས་ སྟན་ལས་ལངས་ཏེ་ བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་ པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་གནས་བརྟན་མ་འགགས་པས་བདག་ལ་ཁྱིམ་བདག་དགྲ་བཅོམ་པ་འཐོབ་པ་སྟེ། འདི་ནི་རྒ་ཤིའི་ཐ་མའོ་ཞེས་དེ་ལྟར་འཇུག་པར་བགྱིས། དེ་སྐད་རྗེས་སུ་བསྟན་མོད་ཀྱི། བདག་བཅོམ་ལྡན་འདས་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྣམས་ཐོས་ནས་ འདི་སྙམ་དུ་གང་འདི་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐེག་པ་ཆེན་པོ་འདི་ནི་མཆོག་གཙོ་བོ། དམ་པ། མཆོག་རབ། གྱ་ནོམ་པ། བླ་ན་ མེད་པའོ་སྙམ་བགྱིད་དོ། ། བཅོམ་ལྡན་འདས་ལས་ཀྱང་བདག་གིས་རབ་ཏུ་རྣམ་པར་ཕྱེ་བའི་ཆོས་རྣམས་ཀྱི་མཆོག་གང་ཡིན་པ་དེ་བསྐྱེད་པར་བྱའོ། ། ཞེས་མངོན་སུམ་དུ་ཐོས་མངོན་སུམ་དུ་བཟུང་ནས་བདག་འདི་སྙམ་དུ་རབ་ཏུ་རྣམ་པར་ཕྱེ་བའི་ཆོས་གཟུང་བ་མ་མཆིས་པ། ངའི་བ་མ་མཆིས་པ། ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་རྣམས་ཀྱིས་ཆོས་གང་མཆོག །གཙོ་བོ། མཆོག་རབ། གྱ་ནོམ་པ། བླ་ན་ མེད་པའི་ཆོས་དེ་ཡང་དག་པར་བསྒྲུབས་ཏེ་འཇུག་གོ་སྙམ་བགྱིད་དོ། ། བཅོམ་ལྡན་འདས་བདག་འདི་སྙམ་དུ་ཐེག་པ་ཐམས་ཅད་ཀྱི་ནང་ན་ནི་སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པར་གནས་པ་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཐེག་པ་ནི་ཐེག་པ་གང་ཇི་སྙེད་པ་དེ་དག་གི་མཆོག་ཏུ་བརྗོད་པ་ནས་བླ་ན་མེད་པའི་བར་དུ་བརྗོད་པ་སྟེ། བཅོམ་ལྡན་འདས་བདག་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་སླད་དུ་ད་སླན་ཆད་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ། ། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་བཅས་པ་ལ་ཡང་བསླབ་པར་བགྱིའོ་སྙམ་བགྱིད་དོ། །
en: Now, in the assembly at that time there was a merchant by the name of Naradatta. Sitting there, in the presence of the Lord, he listened to the cycle of teachings contained in The Collected Teachings on the Bodhisatva that describes the characteristics of the buddhas and the characteristics of the bodhisatvas. He then got up from his seat, placed his robe over one shoulder, knelt down on his right knee, joined his hands in reverence facing in the direction of the Lord, and said, “Lord, the elder Aniruddha has encouraged me and instructed me in the following way: ‘Householder, you must attain the state of an arhat, since this will put an end to aging and death.’ Now that I have listened to this cycle of teachings contained in The Collected Teachings on the Bodhisatva in the presence of the Lord, however, and heard about the characteristics of the buddhas and the characteristics of the bodhisatvas, I have concluded that the Mahāyāna is the best, the most excellent, supreme, superior, and unsurpassed when it comes to unsurpassed perfect awakening. I have heard about it directly from the Lord, including all its detailed teachings, and indeed it is to be cultivated as the very best. Still, when reflecting on it, I also understand that one should not appropriate, identify with, or hold on to each of the detailed dharma-entities. What I should adopt and engage with is the dharma that is the best, the most excellent, supreme, superior, and unsurpassed. In this matter, Lord, it is my view that among all the vehicles, the one that ranks highest is the unsurpassed Buddhayāna. Whatever vehicles there may be, it is the Tathāgatayāna that can be proclaimed as the best among them, and so forth, that can be proclaimed to have nothing that surpasses it. From now on, Lord, I will cultivate the mind of unsurpassed perfect awakening for the sake of the many, for the benefit of the many, for the happiness of the many, for the love of the world, in order to help, benefit, and bring happiness to a great multitude of beings, and for the sake of gods and men. This is how I will train in the bodhisatva training.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། མིས་བྱིན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཡིད་ཆེས་པར་དཀའ་བ། བསྒྲུབ་པར་དཀའ་བའོ། །
en: When he had said this, the Lord addressed the merchant Naradatta: “Naradatta, unsurpassed perfect awakening is difficult to attain. It is difficult to accomplish.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡིད་ཆེས་པར་དཀའ་ཞིང་། བསྒྲུབ་པར་དཀའ་ལགས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་དང་འཐུན་པར་བརྩོན་འགྲུས་བརྩམས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་བགྱིའོ། ། ཅི་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བགྱིའོ། ། བཅོམ་ལྡན་འདས་གལ་ཏེ་སེམས་བསྐྱེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་པར་གྱུར་ལ། སེམས་བསྐྱེད་པ་རེ་རེ་ཡང་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གྱུར་ལ་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ལན་རེ་ཞིང་ཡང་མགོ་གང་གཱའི་བྱེ་མ་སྙེད་ཆད་པར་གྱུར་ཀྱང་དེ་ལྟར་བདག་གིས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་མི་བཏང་སྟེ བཅོམ་ལྡན་འདས་བདག་ནི་རྣམ་གྲངས་འདིས། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་སྤྲོ་ན། གང་བདེ་བའི་ཡོ་བྱད་ཀྱིས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་། རྒྱ་བར་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཇི་ལྟར་བསྐལ་བ་བྱེ་བ་བརྒྱ་སྟོང་དུ་ཚིག་གིས་ཀྱང་ཁོང་དུ་ཆུད་པར་སླ་བ་མ་ལགས་ཏེ་དེ་ལྟར་རྒྱ་ཆེ་བའོ། ། སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་ཀྱང་དེ་ལྟར་རྒྱ་ཆེ་བའོ། ། དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་བོ། །དེ་ལྟར་མཚུངས་པ་མ་མཆིས་སོ། ། དེ་ལྟར་དཔག་ཏུ་མ་མཆིས་སོ། ། དེ་ལྟར་གྲངས་མ་མཆིས་སོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཁྱེན་པ་ཡང་དེ་ལྟར་ཆགས་པ་མ་མཆིས་སོ། ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གྱིས།
en: He then said, “Lord, even if unsurpassed perfect awakening is difficult to attain and difficult to accomplish, there is a certain type of vigorous approach by means of which I can attain unsurpassed perfect awakening. I must not miss the opportunity to attain unsurpassed perfect awakening. Lord, if it is possible to realize unsurpassed perfect awakening by developing a motivation that is as vast as the number of grains of sand in the river Ganges, then may every single such mind of awakening come about, even if it takes as many eons as there are grains of sand in the river Ganges. Even if my head needs to be cut off as many times as there are grains of sand in the river Ganges in order for every such mind of awakening to arise, I will not abandon unsurpassed perfect awakening but continue to work enthusiastically to attain unsurpassed perfect awakening by means of this cycle of instructions. It goes without saying, Lord, that I will employ all means to fully realize awakening. Why will I do this? Lord, I will do this because unsurpassed perfect awakening is so exalted, the unsurpassed qualities of the buddhas are so exalted, and the knowledge of the lords, the buddhas, is so inconceivable, so unequaled, so unfathomable, so immeasurable, and so unimpeded that it cannot be easily comprehended even if one were to speak a hundred thousand million billion words to try to describe it.”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: The merchant’s son Naradatta then spoke these verses:

source: །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་སུ། །བདག་ནི་བྱང་ཆུབ་སེམས་སྐྱེད་ཅིང་། །སྡུག་བསྔལ་ཀུན་གྱིས་གཙེས་གྱུར་ཀྱང་། །སེམས་ཅན་རྣམས་ནི་མི་གཏང་ངོ་། ། སེམས་བསྐྱེད་པ་ནི་ལེན་རེ་ཞིང་། །མགོ་ཡི་ཕུང་པོ་རི་རབ་ཀྱི། །འཕང་ཙམ་མཐོན་པོར་གྱུར་པ་དག། ། ཐམས་ཅད་གཅོད་པར་སྤྲོ་བར་བགྱི། །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་འདི་ལ་བདག་འཇུག་གོ ། དེ་བཞིན་གཤེགས་པ་ཁྱོད་ཅི་འདྲར། །དེ་འདྲ་ཁོ་ནར་གྱུར་པར་ཤོག །
en: “May the mind of awakening arise in me For thousands of millions of eons, And may I not give up on sentient beings For as long as they must suffer all this pain. “For every single moment of this motivation, May I be willing to sever as many of my heads As it would take to make a heap The size of the mountain Meru. “For the benefit of all living beings, I will apply myself to awakening. Just as it is for you, Tathāgata, May this become my sole endeavor.

source: ཐེག་པ་ཆུང་ངུ་ཐེག་པ་དམན། །
en: “The Hīnayāna is a lesser vehicle,

source: ཉན་ཐོས་ཐེག་པ་སྤངས་ནས་ནི། །དེ་བཞིན་གཤེགས་པ་ཁྱད་ཅི་འདྲར། །དེ་འདྲ་ཁོ་ནར་གྱུར་པར་ཤོག །
en: And so having left the Śrāvakayāna behind, May this become my sole endeavor, Just as it is for you, Tathāgata.

source: ཐེག་པ་འདི་ནི་ཐེག་པ་ཆེ། །
en: “This vehicle is the greater vehicle.

source: སངས་རྒྱས་རྣམས་ཀྱིས་མཆོག་ཅེས་བསྔགས། །
en: It is praised by the buddhas as supreme,

source: གཟུང་བར་འོས་པ་གཞན་མ་མཐོང་། །
en: As the proper approach that is not seen by others.

source: དེ་བས་བདག་ནི་བྱང་ཆུབ་མོས། །
en: Thus, I turn toward awakening.

source: གནོད་པར་གྱུར་པ་རྣམས་ལ་སྐྱོབ། །
en: “I will protect those who harm others.

source: ངན་འགྲོ་གསུམ་ལས་ཐར་བར་བགྱིད། །དེ་ཡི་ཕྱིར་ནི་སངས་རྒྱས་དག །དེ་བཞིན་གཤེགས་པ་རྣམས་འབྱུང་ངོ་། །
en: I will free them from the three lower realms. This is why the buddhas Appear as tathāgatas.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་དག་ཤེས་ལ་གང་བུ་དང་ཆུང་མ་དག་ཆོས་འདི་དག་ཡང་དག་པར་འཛིན་དུ་མ་བཅུག་ན། འདི་ནི་བདག་གི་མི་ཆའོ་སྙམ་ནས་དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ རིངས་ཤིང་མྱུར་བའི་གཟུགས་ཀྱིས་རང་གི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ ཆུང་མ་བདུན་དང་། ཁྱེའུ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་ཕོ་བདུན་དང་། བྲན་མོ་བདུན་དང་། ལྷན་ཅིག་ཏུ་རས་བཅོས་བུ་ཟུང་སྟོང་ཐོགས་ཏེ་ རོལ་མོ་མཁན་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བར་འདོད་པས་རིངས་ཤིང་མྱུར་བའི་གཟུགས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་བ་དང་། རྒྱལ་པོའི་ཁབ་ཀྱི་མི་དང་མི་མ་ཡིན་པ་རབ་ཏུ་མང་པོ་དག་གིས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་གཡོག་དང་བཅས་ཏེ་ རིངས་ཤིང་མྱུར་བའི་གཟུགས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་བར་མཐོང་ངོ་། ། མཐོང་ནས་ཀྱང་འདི་སྐད་ཅེས་མིས་བྱིན་ཁྱོད་གཡོག་དང་བཅས་ཏེ། རིངས་ཤིང་མྱུར་བའི་གཟུགས་ཀྱིས་གར་ཆ་ཞེས་འཛེར་པ་དང་།
en: The merchant Naradatta then thought, “I now see the vastness of the Dharma of the Buddha. I see that one cannot properly engage with this Dharma with a wife and children, but such is my lot.” He then honored the Lord by placing his head at his feet. He circumambulated the Lord three times, and then quickly, with great haste, he returned to his house. Then, together with seven wives, seven sons, seven daughters, seven male servants, and seven female servants, carrying a thousand pairs of garments made of calico, and with five hundred musicians, he departed from the city of Rājagṛha to see the Lord. When all the many human and nonhuman inhabitants of Rājagṛha saw that the merchant Naradatta, together with his servants, was departing from the city of Rājagṛha quickly, with great haste, they asked him, “Naradatta, where are you headed with your servants?”

source: སྨྲས་པ་སྐྱེས་བུ་ཁྱེད་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་ཏེ མདུན་དུ་བདར་ནས་རྣམ་གྲངས་དུ་མས་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་དག་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་དག་གི་དོན་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་ཅིང་མཚུངས་པ་མེད་པ་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་བ་དག་གཡོག་དང་བཅས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ག་ལ་བ་དེར་སོང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དགེ་བའི་རྩ་བ་སྐྱེད་པར་བྱེད་པ་མི་ཤེས་པ་སྟེ། གལ་ཏེ་ཁྱེད་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་དག་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་ན་ཚུར་ཤོག་འདོང་ངོ་། ། བཅོམ་ལྡན་འདས་དེའི་གན་དུ་འདོང་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེ་བ་རྒྱ་ཆེ་བ་དག་གི་དོན་གྱི་ཕྱིར་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བྱའོ། ། དེ་ལྟར་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་མིས་བྱིན་གྱི་ཚིག་དེ་ཐོས་ནས་སྲོག་ཆགས་ཁྲི་ཕྱི་བཞིན་དུ་འབྲང་བར་གྱུར་ཏོ། །
en: He replied, “Gentlemen. The tathāgata, arhat, fully accomplished Buddha is now on Vulture’s Peak, surrounded by an assembly that numbers in the hundreds, in the thousands, and he is revealing the boundless qualities of the buddhas in various ways. In order to penetrate the meaning of the boundless qualities of the buddhas and the inconceivable, unparalleled knowledge of the buddhas, I am going, together with my servants, to the place where the tathāgata, arhat, fully accomplished Buddha is staying, because I do not know how to cultivate the roots of virtue necessary to attain unsurpassed perfect awakening. If you wish to master the boundless qualities of the buddhas, then join me. Come with me to see the Lord. Cultivate roots of virtue with the boundless goal of the boundless qualities of the buddhas.” When the people of Rājagṛha heard Naradatta’s words, ten thousand of them followed him.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མིས་བྱིན་ཆུང་མ་བདུན་དང་། ཁྱེའུ་བདུན་དང་། བུ་མོ་བདུན་དང་། བྲན་ཕོ་བདུན་དང་། བྲན་མོ་བདུན་དང་། ལྷན་ཅིག་ཏུ་རས་བཅོས་བུ་ཟུང་སྟོང་ཐོགས་ནས་ སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་དང་། རོལ་མོ་མཁན་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྔ་དང་། རོལ་མོ་སིལ་སྙན་དཀྲོལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་རས་བཅོས་བུ་ཟུང་སྟོང་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: The merchant Naradatta, together with his seven wives, seven sons, seven daughters, seven male servants, and seven female servants, carrying a thousand pairs of garments made of calico, together with the ten thousand beings who had followed him from the city and five hundred musicians, bringing with him flowers, incense, garlands, ointments, aromatic powders, fabrics, parasols, royal banners, and flags, and playing drums and cymbals, made offerings to the Lord and adorned the body of the Lord with the thousand pairs of calico garments. Then he spoke these verses:

source: སེམས་ཅན་དམ་པ་མི་མཆོག་གང་ལགས་པ། །བྱང་ཆུབ་མཆོག་ཏུ་རྣམ་པར་དག་པར་སྤྱོད། ། མཐའ་ཡས་གཟིགས་པ་རྐང་གཉིས་རྣམས་ཀྱི་མཆོག །དེ་ལ་དེ་རིང་བདག་ནི་མཆོད་པར་བགྱི། །
en: “Today I make this offering To the one who is sublime among sentient beings, Who practices pure conduct for the sake of supreme awakening, Whose vision is limitless, the best of those who walk on two feet.

source: གང་ཞིག་སྔོན་གྱི་བསྐལ་བ་མང་པོར་སྤྱད། ། སྲོག་ཆགས་རྣམས་ལ་ཕན་ཕྱིར་བྱང་ཆུབ་བཙལ། །རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་དབང་མཆོག་བརྙེས། །དེ་ལ་དེ་རིང་བདག་གིས་མཆོད་པར་བགྱི། །
en: “Today I make this offering To the one who has practiced for many eons in the past, Searching for awakening to benefit living beings, The perfect Buddha who has found the supremely powerful Dharma.

source: བུ་དང་བྲན་བཅས་ཉེ་དུའི་ཚོགས་དང་བཅས། །
en: “With children and servants, and with a host of kinsmen,
